DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=176
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 50 b6 1b 9b 13 59 44 13 8c 39 63 64 1e |yo.P....YD..9cd.|
|00000030| db 89 55 81 65 76 61 ec 01 03 03 01 62 61 74 63 |..U.eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 50 b6 1b 9b 13 59 44 13 8c 39 63 64 1e |yo.P....YD..9cd.|
|00000030| db 89 55 81 65 76 61 ec 01 03 03 01 62 61 74 63 |..U.eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 50 b6 1b 9b 13 59 44 13 8c 39 63 64 1e |yo.P....YD..9cd.|
|00000030| db 89 55 81 65 76 61 ec 01 03 03 01 62 61 74 63 |..U.eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED: RequestMessage{, requestId=50b61b9b-1359-4413-8c39-63641edb8955, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Selecting processor for RequestMessage RequestMessage{, requestId=50b61b9b-1359-4413-8c39-63641edb8955, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.standard.StandardOpProcessor - Sessionless request 50b61b9b-1359-4413-8c39-63641edb8955 for eval in thread gremlin-server-worker-1
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Preparing to evaluate script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-worker-1]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Schedule timeout for script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-exec-2]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Evaluating script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-exec-2]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Preparing to iterate results from - RequestMessage{, requestId=50b61b9b-1359-4413-8c39-63641edb8955, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}} - in thread [gremlin-server-exec-2]
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE: org.apache.tinkerpop.gremlin.server.handler.Frame@c659fa0
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 47, cap: 47)), 47B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 01 50 b6 1b 9b 13 59 44 13 8c 39 63 64 1e db 89 |.P....YD..9cd...|
|00000010| 55 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 6b ef |U...6......mark.|
|00000020| 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 01    |..jos...pete.6. |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=47
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 50 b6 1b 9b 13 59 44 13 8c 39 63 64 1e |./.P....YD..9cd.|
|00000010| db 89 55 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |..U...6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 50 b6 1b 9b 13 59 44 13 8c 39 63 64 1e |./.P....YD..9cd.|
|00000010| db 89 55 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |..U...6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 50 b6 1b 9b 13 59 44 13 8c 39 63 64 1e |./.P....YD..9cd.|
|00000010| db 89 55 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |..U...6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - g.V().hasLabel('software').has('name',n).in('created').values('name') - as the eval completed (possibly with exception).
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=47
DEBUG gremlin-driver-worker-1 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Attempting to return Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG gremlin-driver-worker-1 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Announce connection available on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[session]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[control]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[traversal]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down thread pools.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Gremlin thread pool.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Worker thread pool.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Boss thread pool.
DEBUG gremlin-server-worker-1 log-io - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] INACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] INACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] UNREGISTERED
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Executing shutdown LifeCycleHook
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 ! R:/127.0.0.1:60007] UNREGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] INACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] INACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] UNREGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 ! R:/127.0.0.1:60006] UNREGISTERED
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 1 thread-local buffer(s) from thread: gremlin-server-exec-2
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [graph]
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [test_graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [test_graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Gremlin Server - shutdown complete
INFO main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Signalled closing of connection pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} with core size of 2
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 5 thread-local buffer(s) from thread: gremlin-server-worker-1
DEBUG main io.netty.util.internal.logging.InternalLoggerFactory - Using SLF4J as the default logging framework
DEBUG main io.netty.channel.MultithreadEventLoopGroup - -Dio.netty.eventLoopThreads: 16
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.Buffer.address: available
DEBUG main io.netty.util.internal.PlatformDependent0 - sun.misc.Unsafe.theUnsafe: available
DEBUG main io.netty.util.internal.PlatformDependent0 - sun.misc.Unsafe.copyMemory: available
DEBUG main io.netty.util.internal.PlatformDependent0 - direct buffer constructor: available
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.Bits.unaligned: available, true
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.DirectByteBuffer.<init>(long, int): available
DEBUG main io.netty.util.internal.Cleaner0 - java.nio.ByteBuffer.cleaner(): available
DEBUG main io.netty.util.internal.PlatformDependent - Java version: 8
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noUnsafe: false
DEBUG main io.netty.util.internal.PlatformDependent - sun.misc.Unsafe: available
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noJavassist: false
DEBUG main io.netty.util.internal.PlatformDependent - Javassist: unavailable
DEBUG main io.netty.util.internal.PlatformDependent - You don't have Javassist in your class path or you don't have enough permission to load dynamically generated classes.  Please check the configuration for better performance.
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.tmpdir: /var/folders/nq/kbh848m57f99nh511y49kysw0000gn/T (java.io.tmpdir)
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.bitMode: 64 (sun.arch.data.model)
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noPreferDirect: false
DEBUG main io.netty.util.internal.PlatformDependent - io.netty.maxDirectMemory: 1908932608 bytes
DEBUG main io.netty.channel.nio.NioEventLoop - -Dio.netty.noKeySetOptimization: false
DEBUG main io.netty.channel.nio.NioEventLoop - -Dio.netty.selectorAutoRebuildThreshold: 512
DEBUG main io.netty.util.internal.PlatformDependent - org.jctools-core.MpscChunkedArrayQueue: available
INFO main org.apache.tinkerpop.gremlin.server.util.MetricManager - Configured Metrics Slf4jReporter configured with interval=180000ms and loggerName=org.apache.tinkerpop.gremlin.server.Settings$Slf4jReporterMetrics
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - FileName set to tinkergraph-empty.properties
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - Base path set to /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - ConfigurationUtils.locate(): base is /Users/aelmanaa/Applications/app/conf, name is tinkergraph-empty.properties
DEBUG main org.apache.commons.configuration.DefaultFileSystem - Could not locate file tinkergraph-empty.properties at /Users/aelmanaa/Applications/app/conf: no protocol: /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - Loading configuration from the path /Users/aelmanaa/Applications/app/conf/tinkergraph-empty.properties
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Graph [graph] was successfully configured via [conf/tinkergraph-empty.properties].
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - FileName set to tinkergraph-test.properties
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - Base path set to /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - ConfigurationUtils.locate(): base is /Users/aelmanaa/Applications/app/conf, name is tinkergraph-test.properties
DEBUG main org.apache.commons.configuration.DefaultFileSystem - Could not locate file tinkergraph-test.properties at /Users/aelmanaa/Applications/app/conf: no protocol: /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - Loading configuration from the path /Users/aelmanaa/Applications/app/conf/tinkergraph-test.properties
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Graph [test_graph] was successfully configured via [conf/tinkergraph-test.properties].
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - Initialized Gremlin thread pool.  Threads in pool named with pattern gremlin-*
INFO main org.apache.tinkerpop.gremlin.groovy.engine.ScriptEngines - Loaded gremlin-groovy ScriptEngine
INFO main org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Initialized gremlin-groovy ScriptEngine with scripts/generate-modern.groovy
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - Initialized GremlinExecutor and configured ScriptEngines.
DEBUG main org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Preparing to evaluate script - 1+1 - in thread [main]
DEBUG gremlin-server-exec-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Schedule timeout for script - 1+1 - in thread [gremlin-server-exec-1]
DEBUG gremlin-server-exec-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Evaluating script - 1+1 - in thread [gremlin-server-exec-1]
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - 1+1 - as the eval completed (possibly with exception).
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - A GraphTraversalSource is now bound to [test] with graphtraversalsource[tinkergraph[vertices:0 edges:0], standard]
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - A GraphTraversalSource is now bound to [g] with graphtraversalsource[tinkergraph[vertices:0 edges:0], standard]
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the standard OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the control OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the session OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the traversal OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.traversal.TraversalOpProcessor - Initialized cache for TraversalOpProcessor with size 1000 and expiration time of 600000 ms
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.numHeapArenas: 16
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.numDirectArenas: 16
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.pageSize: 8192
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.maxOrder: 11
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.chunkSize: 16777216
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.tinyCacheSize: 512
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.smallCacheSize: 256
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.normalCacheSize: 64
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.maxCachedBufferCapacity: 32768
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.cacheTrimInterval: 8192
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Executing start up LifeCycleHook
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Loading 'modern' graph data.
INFO main org.apache.tinkerpop.gremlin.server.AbstractChannelizer - Configured application/vnd.gremlin-v1.0+gryo with org.apache.tinkerpop.gremlin.driver.ser.GryoMessageSerializerV1d0
INFO main org.apache.tinkerpop.gremlin.server.AbstractChannelizer - Configured application/vnd.gremlin-v1.0+gryo-stringd with org.apache.tinkerpop.gremlin.driver.ser.GryoMessageSerializerV1d0
DEBUG main io.netty.util.internal.ThreadLocalRandom - -Dio.netty.initialSeedUniquifier: 0x07a6cf4d751faee5 (took 0 ms)
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.allocator.type: unpooled
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.threadLocalDirectBufferSize: 65536
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.maxThreadLocalCharBufferSize: 16384
DEBUG main io.netty.util.NetUtil - Loopback interface: lo0 (lo0, 0:0:0:0:0:0:0:1)
DEBUG main io.netty.util.NetUtil - /proc/sys/net/core/somaxconn: 128 (non-existent)
INFO gremlin-server-boss-1 org.apache.tinkerpop.gremlin.server.GremlinServer - Gremlin Server configured with worker thread pool of 1, gremlin pool of 8 and boss thread pool of 1.
INFO gremlin-server-boss-1 org.apache.tinkerpop.gremlin.server.GremlinServer - Channel started at port 45940.
DEBUG main org.apache.tinkerpop.gremlin.driver.Client - Initializing client on cluster [localhost/127.0.0.1:45940]
DEBUG gremlin-driver-loop-1 io.netty.buffer.AbstractByteBuf - -Dio.netty.buffer.bytebuf.checkAccessible: true
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetector - -Dio.netty.leakDetection.level: simple
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetector - -Dio.netty.leakDetection.maxRecords: 4
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetectorFactory - Loaded default ResourceLeakDetector: io.netty.util.ResourceLeakDetector@79d35baa
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpRequestDecoder settings - maxInitialLineLength=4096, maxHeaderSize=8192, maxChunkSize=8192
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpObjectAggregator settings - maxContentLength=65536, maxAccumulationBufferComponents=1024
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocketClientHandshaker13 - WebSocket version 13 client handshake key: qSZbQ2DBUTv1UMpfvT13Eg==, expected response: EAsrpcK9pfAwg+YsGNRsimn9FbY=
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] REGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] REGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] ACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] ACTIVE
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.maxCapacity.default: 32768
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.maxSharedCapacityFactor: 2
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.linkCapacity: 16
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.ratio: 8
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: 207B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 47 45 54 20 2f 67 72 65 6d 6c 69 6e 20 48 54 54 |GET /gremlin HTT|
|00000010| 50 2f 31 2e 31 0d 0a 55 70 67 72 61 64 65 3a 20 |P/1.1..Upgrade: |
|00000020| 57 65 62 53 6f 63 6b 65 74 0d 0a 43 6f 6e 6e 65 |WebSocket..Conne|
|00000030| 63 74 69 6f 6e 3a 20 55 70 67 72 61 64 65 0d 0a |ction: Upgrade..|
|00000040| 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d 4b 65 |Sec-WebSocket-Ke|
|00000050| 79 3a 20 71 53 5a 62 51 32 44 42 55 54 76 31 55 |y: qSZbQ2DBUTv1U|
|00000060| 4d 70 66 76 54 31 33 45 67 3d 3d 0d 0a 48 6f 73 |MpfvT13Eg==..Hos|
|00000070| 74 3a 20 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 |t: localhost:459|
|00000080| 34 30 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 |40..Sec-WebSocke|
|00000090| 74 2d 4f 72 69 67 69 6e 3a 20 68 74 74 70 3a 2f |t-Origin: http:/|
|000000a0| 2f 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 34 30 |/localhost:45940|
|000000b0| 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d |..Sec-WebSocket-|
|000000c0| 56 65 72 73 69 6f 6e 3a 20 31 33 0d 0a 0d 0a    |Version: 13.... |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: DefaultHttpRequest(decodeResult: success, version: HTTP/1.1)
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: qSZbQ2DBUTv1UMpfvT13Eg==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED, EmptyLastHttpContent, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED, HttpObjectAggregator$AggregatedFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: CompositeByteBuf(ridx: 0, widx: 0, cap: 0, components=0))
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: qSZbQ2DBUTv1UMpfvT13Eg==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
Content-Length: 0, 0B
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WebSocket version V13 server handshake
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - WebSocket version 13 server handshake key: qSZbQ2DBUTv1UMpfvT13Eg==, response: EAsrpcK9pfAwg+YsGNRsimn9FbY=
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: EAsrpcK9pfAwg+YsGNRsimn9FbY=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: EAsrpcK9pfAwg+YsGNRsimn9FbY=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 45 41 73 72 70 63 4b 39 70 66 41 77 67 2b 59 | EAsrpcK9pfAwg+Y|
|00000070| 73 47 4e 52 73 69 6d 6e 39 46 62 59 3d 0d 0a 0d |sGNRsimn9FbY=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 45 41 73 72 70 63 4b 39 70 66 41 77 67 2b 59 | EAsrpcK9pfAwg+Y|
|00000070| 73 47 4e 52 73 69 6d 6e 39 46 62 59 3d 0d 0a 0d |sGNRsimn9FbY=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 45 41 73 72 70 63 4b 39 70 66 41 77 67 2b 59 | EAsrpcK9pfAwg+Y|
|00000070| 73 47 4e 52 73 69 6d 6e 39 46 62 59 3d 0d 0a 0d |sGNRsimn9FbY=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] USER_EVENT: HANDSHAKE_COMPLETE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] USER_EVENT: HANDSHAKE_COMPLETE
INFO main org.apache.tinkerpop.gremlin.driver.Connection - Created new connection for ws://localhost:45940/gremlin
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpRequestDecoder settings - maxInitialLineLength=4096, maxHeaderSize=8192, maxChunkSize=8192
DEBUG gremlin-driver-loop-2 io.netty.handler.codec.http.websocketx.WebSocketClientHandshaker13 - WebSocket version 13 client handshake key: YDX2s1Z/Ytl6sILBgORcWQ==, expected response: CMIxBQcZYcFU3hVsK2WKl4wTG+4=
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpObjectAggregator settings - maxContentLength=65536, maxAccumulationBufferComponents=1024
DEBUG gremlin-server-worker-1 log-io - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] REGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] REGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] ACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] ACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] RECEIVED: 207B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 47 45 54 20 2f 67 72 65 6d 6c 69 6e 20 48 54 54 |GET /gremlin HTT|
|00000010| 50 2f 31 2e 31 0d 0a 55 70 67 72 61 64 65 3a 20 |P/1.1..Upgrade: |
|00000020| 57 65 62 53 6f 63 6b 65 74 0d 0a 43 6f 6e 6e 65 |WebSocket..Conne|
|00000030| 63 74 69 6f 6e 3a 20 55 70 67 72 61 64 65 0d 0a |ction: Upgrade..|
|00000040| 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d 4b 65 |Sec-WebSocket-Ke|
|00000050| 79 3a 20 59 44 58 32 73 31 5a 2f 59 74 6c 36 73 |y: YDX2s1Z/Ytl6s|
|00000060| 49 4c 42 67 4f 52 63 57 51 3d 3d 0d 0a 48 6f 73 |ILBgORcWQ==..Hos|
|00000070| 74 3a 20 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 |t: localhost:459|
|00000080| 34 30 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 |40..Sec-WebSocke|
|00000090| 74 2d 4f 72 69 67 69 6e 3a 20 68 74 74 70 3a 2f |t-Origin: http:/|
|000000a0| 2f 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 34 30 |/localhost:45940|
|000000b0| 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d |..Sec-WebSocket-|
|000000c0| 56 65 72 73 69 6f 6e 3a 20 31 33 0d 0a 0d 0a    |Version: 13.... |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] RECEIVED: DefaultHttpRequest(decodeResult: success, version: HTTP/1.1)
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: YDX2s1Z/Ytl6sILBgORcWQ==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] RECEIVED, EmptyLastHttpContent, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] RECEIVED, HttpObjectAggregator$AggregatedFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: CompositeByteBuf(ridx: 0, widx: 0, cap: 0, components=0))
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: YDX2s1Z/Ytl6sILBgORcWQ==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
Content-Length: 0, 0B
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] WebSocket version V13 server handshake
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - WebSocket version 13 server handshake key: YDX2s1Z/Ytl6sILBgORcWQ==, response: CMIxBQcZYcFU3hVsK2WKl4wTG+4=
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: CMIxBQcZYcFU3hVsK2WKl4wTG+4=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: CMIxBQcZYcFU3hVsK2WKl4wTG+4=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 43 4d 49 78 42 51 63 5a 59 63 46 55 33 68 56 | CMIxBQcZYcFU3hV|
|00000070| 73 4b 32 57 4b 6c 34 77 54 47 2b 34 3d 0d 0a 0d |sK2WKl4wTG+4=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 43 4d 49 78 42 51 63 5a 59 63 46 55 33 68 56 | CMIxBQcZYcFU3hV|
|00000070| 73 4b 32 57 4b 6c 34 77 54 47 2b 34 3d 0d 0a 0d |sK2WKl4wTG+4=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 43 4d 49 78 42 51 63 5a 59 63 46 55 33 68 56 | CMIxBQcZYcFU3hV|
|00000070| 73 4b 32 57 4b 6c 34 77 54 47 2b 34 3d 0d 0a 0d |sK2WKl4wTG+4=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] USER_EVENT: HANDSHAKE_COMPLETE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 - R:/127.0.0.1:60019] USER_EVENT: HANDSHAKE_COMPLETE
INFO main org.apache.tinkerpop.gremlin.driver.Connection - Created new connection for ws://localhost:45940/gremlin
INFO main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Opening connection pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} with core size of 2
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Borrowing connection from pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} - timeout in 3000 MILLISECONDS
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Return least used Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}, isDead=false, borrowed=1, pending=0} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG main org.apache.tinkerpop.gremlin.driver.Client - Submitted RequestMessage{, requestId=d58cd794-8ef2-418f-896a-46da16f2ba40, op='eval', processor='', args={batchSize=64, gremlin=test.addV().property('name',personName), bindings={personName=Myamoto}}} to - Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}}
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=156
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: 164B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 fe 00 9c 0a 1c 72 f8 2b 7d 02 88 66 75 11 99 |......r.+}..fu..|
|00000010| 7e 75 1d 96 25 6a 1c 9c 24 7b 00 9d 67 70 1b 96 |~u..%j..${..gp..|
|00000020| 27 6a 43 d6 3a 37 15 8a 73 73 73 2d 86 cb e6 76 |'jC.:7..sss-...v|
|00000030| f8 5d fd 71 60 5a a8 ee f8 a6 32 79 6f 6a 13 14 |.].q`Z....2yoj..|
|00000040| 0b 1f 71 f9 68 7d 06 9b 62 4f 1b 82 ef 1e f2 f9 |..q.h}..bO......|
|00000050| 09 1d 15 8a 6f 71 1e 91 e4 1f 73 8c 6f 6f 06 d6 |....oq....s.oo..|
|00000060| 6b 78 16 ae 22 35 5c 88 78 73 02 9d 78 68 0b d0 |kx.."5\.xs..xh..|
|00000070| 2d 72 13 95 6f 3b 5e 88 6f 6e 01 97 64 52 13 95 |-r..o;^.on..dR..|
|00000080| 6f b5 71 f9 68 75 1c 9c 63 72 15 0b 07 1d 73 fb |o.q.hu..cr....s.|
|00000090| 0b 6c 17 8a 79 73 1c b6 6b 71 97 fb 0b 51 0b 99 |.l..ys..kq...Q..|
|000000a0| 67 73 06 17                                     |gs..            |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=156
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 156, cap: 156)), 156B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 d5 8c d7 94 8e f2 41 8f 89 6a 46 da 16 |yo.......A..jF..|
|00000030| f2 ba 40 81 65 76 61 ec 01 03 03 01 62 61 74 63 |..@.eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 74 65 73 74 2e 61 64 64 56 28 29 2e 70 |...test.addV().p|
|00000060| 72 6f 70 65 72 74 79 28 27 6e 61 6d 65 27 2c 70 |roperty('name',p|
|00000070| 65 72 73 6f 6e 4e 61 6d 65 a9 03 01 62 69 6e 64 |ersonName...bind|
|00000080| 69 6e 67 f3 0d 01 01 03 01 70 65 72 73 6f 6e 4e |ing......personN|
|00000090| 61 6d e5 03 01 4d 79 61 6d 6f 74 ef             |am...Myamot.    |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 156, cap: 156)), 156B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 d5 8c d7 94 8e f2 41 8f 89 6a 46 da 16 |yo.......A..jF..|
|00000030| f2 ba 40 81 65 76 61 ec 01 03 03 01 62 61 74 63 |..@.eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 74 65 73 74 2e 61 64 64 56 28 29 2e 70 |...test.addV().p|
|00000060| 72 6f 70 65 72 74 79 28 27 6e 61 6d 65 27 2c 70 |roperty('name',p|
|00000070| 65 72 73 6f 6e 4e 61 6d 65 a9 03 01 62 69 6e 64 |ersonName...bind|
|00000080| 69 6e 67 f3 0d 01 01 03 01 70 65 72 73 6f 6e 4e |ing......personN|
|00000090| 61 6d e5 03 01 4d 79 61 6d 6f 74 ef             |am...Myamot.    |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 156, cap: 156)), 156B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 d5 8c d7 94 8e f2 41 8f 89 6a 46 da 16 |yo.......A..jF..|
|00000030| f2 ba 40 81 65 76 61 ec 01 03 03 01 62 61 74 63 |..@.eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 74 65 73 74 2e 61 64 64 56 28 29 2e 70 |...test.addV().p|
|00000060| 72 6f 70 65 72 74 79 28 27 6e 61 6d 65 27 2c 70 |roperty('name',p|
|00000070| 65 72 73 6f 6e 4e 61 6d 65 a9 03 01 62 69 6e 64 |ersonName...bind|
|00000080| 69 6e 67 f3 0d 01 01 03 01 70 65 72 73 6f 6e 4e |ing......personN|
|00000090| 61 6d e5 03 01 4d 79 61 6d 6f 74 ef             |am...Myamot.    |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: RequestMessage{, requestId=d58cd794-8ef2-418f-896a-46da16f2ba40, op='eval', processor='', args={gremlin=test.addV().property('name',personName), bindings={personName=Myamoto}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Selecting processor for RequestMessage RequestMessage{, requestId=d58cd794-8ef2-418f-896a-46da16f2ba40, op='eval', processor='', args={gremlin=test.addV().property('name',personName), bindings={personName=Myamoto}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.standard.StandardOpProcessor - Sessionless request d58cd794-8ef2-418f-896a-46da16f2ba40 for eval in thread gremlin-server-worker-1
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Preparing to evaluate script - test.addV().property('name',personName) - in thread [gremlin-server-worker-1]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Schedule timeout for script - test.addV().property('name',personName) - in thread [gremlin-server-exec-2]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Evaluating script - test.addV().property('name',personName) - in thread [gremlin-server-exec-2]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Preparing to iterate results from - RequestMessage{, requestId=d58cd794-8ef2-418f-896a-46da16f2ba40, op='eval', processor='', args={gremlin=test.addV().property('name',personName), bindings={personName=Myamoto}, batchSize=64}} - in thread [gremlin-server-exec-2]
INFO gremlin-server-exec-2 com.my.ExampleMutationListener - AMINE vertexAdded!!!!! v[96a86f2a-67c8-47ed-98b6-b195c09a8561]
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: org.apache.tinkerpop.gremlin.server.handler.Frame@31bfec2a
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 82, cap: 82)), 82B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 01 d5 8c d7 94 8e f2 41 8f 89 6a 46 da 16 f2 ba |.......A..jF....|
|00000010| 40 00 c8 81 36 01 0c 01 01 44 01 15 01 13 01 96 |@...6....D......|
|00000020| a8 6f 2a 67 c8 47 ed 98 b6 b1 95 c0 9a 85 61 01 |.o*g.G........a.|
|00000030| 76 65 72 74 65 f8 0d 01 01 01 6e 61 6d e5 0c 01 |verte.....nam...|
|00000040| 01 16 01 09 00 08 00 03 01 4d 79 61 6d 6f 74 ef |.........Myamot.|
|00000050| 36 01                                           |6.              |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=82
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 84B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 52 01 d5 8c d7 94 8e f2 41 8f 89 6a 46 da 16 |.R.......A..jF..|
|00000010| f2 ba 40 00 c8 81 36 01 0c 01 01 44 01 15 01 13 |..@...6....D....|
|00000020| 01 96 a8 6f 2a 67 c8 47 ed 98 b6 b1 95 c0 9a 85 |...o*g.G........|
|00000030| 61 01 76 65 72 74 65 f8 0d 01 01 01 6e 61 6d e5 |a.verte.....nam.|
|00000040| 0c 01 01 16 01 09 00 08 00 03 01 4d 79 61 6d 6f |...........Myamo|
|00000050| 74 ef 36 01                                     |t.6.            |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 84B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 52 01 d5 8c d7 94 8e f2 41 8f 89 6a 46 da 16 |.R.......A..jF..|
|00000010| f2 ba 40 00 c8 81 36 01 0c 01 01 44 01 15 01 13 |..@...6....D....|
|00000020| 01 96 a8 6f 2a 67 c8 47 ed 98 b6 b1 95 c0 9a 85 |...o*g.G........|
|00000030| 61 01 76 65 72 74 65 f8 0d 01 01 01 6e 61 6d e5 |a.verte.....nam.|
|00000040| 0c 01 01 16 01 09 00 08 00 03 01 4d 79 61 6d 6f |...........Myamo|
|00000050| 74 ef 36 01                                     |t.6.            |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 84B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 52 01 d5 8c d7 94 8e f2 41 8f 89 6a 46 da 16 |.R.......A..jF..|
|00000010| f2 ba 40 00 c8 81 36 01 0c 01 01 44 01 15 01 13 |..@...6....D....|
|00000020| 01 96 a8 6f 2a 67 c8 47 ed 98 b6 b1 95 c0 9a 85 |...o*g.G........|
|00000030| 61 01 76 65 72 74 65 f8 0d 01 01 01 6e 61 6d e5 |a.verte.....nam.|
|00000040| 0c 01 01 16 01 09 00 08 00 03 01 4d 79 61 6d 6f |...........Myamo|
|00000050| 74 ef 36 01                                     |t.6.            |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - test.addV().property('name',personName) - as the eval completed (possibly with exception).
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=82
DEBUG gremlin-driver-worker-1 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Attempting to return Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG gremlin-driver-worker-1 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Announce connection available on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Borrowing connection from pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} - timeout in 3000 MILLISECONDS
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Return least used Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}, isDead=false, borrowed=1, pending=0} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG main org.apache.tinkerpop.gremlin.driver.Client - Submitted RequestMessage{, requestId=1fc6a4e9-9a3d-4158-9bc6-cba6472410c3, op='eval', processor='', args={batchSize=64, gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}}} to - Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}}
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=176
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: 184B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 fe 00 b0 3e 25 d7 18 1f 44 a7 68 52 4c b4 79 |....>%...D.hRL.y|
|00000010| 4a 4c b8 76 11 53 b9 7c 10 42 a5 7d 53 49 be 76 |JL.v.S.|.B.}SI.v|
|00000020| 13 53 e6 36 0e 0e b0 6a 47 4a d6 07 f8 81 3e 82 |.S.6...jGJ....>.|
|00000030| 03 64 8f 83 f8 ee 71 5f 1a 35 14 99 5b 53 b6 f4 |.d....q_.5..[S..|
|00000040| 3f 26 d4 19 5c 44 a3 7b 56 76 be 62 db 27 57 19 |?&..\D.{Vv.b.'W.|
|00000050| 3d 24 b0 6a 5b 48 bb 71 d0 26 d6 de 3f 42 f9 4e |=$.j[H.q.&..?B.N|
|00000060| 16 0c f9 70 5f 56 9b 79 5c 40 bb 30 19 56 b8 7e |...p_V.y\@.0.V.~|
|00000070| 4a 52 b6 6a 5b 02 fe 36 56 44 a4 30 19 4b b6 75 |JR.j[..6VD.0.K.u|
|00000080| 5b 02 fb 76 17 0b be 76 16 02 b4 6a 5b 44 a3 7d |[..v...v...j[D.}|
|00000090| 5a 02 fe 36 48 44 bb 6d 5b 56 ff 3f 50 44 ba 7d |Z..6HD.m[V.?PD.}|
|000000a0| 19 0c d4 19 5c 4c b9 7c 57 4b b0 eb 33 24 d6 1b |....\L.|WK..3$..|
|000000b0| 3f a7 b9 1b 3f 49 b8 e8                         |?...?I..        |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=176
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 1f c6 a4 e9 9a 3d 41 58 9b c6 cb a6 47 |yo......=AX....G|
|00000030| 24 10 c3 81 65 76 61 ec 01 03 03 01 62 61 74 63 |$...eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 1f c6 a4 e9 9a 3d 41 58 9b c6 cb a6 47 |yo......=AX....G|
|00000030| 24 10 c3 81 65 76 61 ec 01 03 03 01 62 61 74 63 |$...eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 1f c6 a4 e9 9a 3d 41 58 9b c6 cb a6 47 |yo......=AX....G|
|00000030| 24 10 c3 81 65 76 61 ec 01 03 03 01 62 61 74 63 |$...eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] RECEIVED: RequestMessage{, requestId=1fc6a4e9-9a3d-4158-9bc6-cba6472410c3, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Selecting processor for RequestMessage RequestMessage{, requestId=1fc6a4e9-9a3d-4158-9bc6-cba6472410c3, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.standard.StandardOpProcessor - Sessionless request 1fc6a4e9-9a3d-4158-9bc6-cba6472410c3 for eval in thread gremlin-server-worker-1
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Preparing to evaluate script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-worker-1]
DEBUG gremlin-server-exec-3 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Schedule timeout for script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-exec-3]
DEBUG gremlin-server-exec-3 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Evaluating script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-exec-3]
DEBUG gremlin-server-exec-3 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Preparing to iterate results from - RequestMessage{, requestId=1fc6a4e9-9a3d-4158-9bc6-cba6472410c3, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}} - in thread [gremlin-server-exec-3]
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: org.apache.tinkerpop.gremlin.server.handler.Frame@2faa8039
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 47, cap: 47)), 47B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 01 1f c6 a4 e9 9a 3d 41 58 9b c6 cb a6 47 24 10 |......=AX....G$.|
|00000010| c3 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 6b ef |....6......mark.|
|00000020| 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 01    |..jos...pete.6. |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=47
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 1f c6 a4 e9 9a 3d 41 58 9b c6 cb a6 47 |./......=AX....G|
|00000010| 24 10 c3 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |$.....6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 1f c6 a4 e9 9a 3d 41 58 9b c6 cb a6 47 |./......=AX....G|
|00000010| 24 10 c3 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |$.....6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 1f c6 a4 e9 9a 3d 41 58 9b c6 cb a6 47 |./......=AX....G|
|00000010| 24 10 c3 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |$.....6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 - R:/127.0.0.1:60018] FLUSH
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - g.V().hasLabel('software').has('name',n).in('created').values('name') - as the eval completed (possibly with exception).
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=47
DEBUG gremlin-driver-worker-5 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Attempting to return Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG gremlin-driver-worker-5 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Announce connection available on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[session]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[control]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[traversal]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down thread pools.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Gremlin thread pool.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Worker thread pool.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Boss thread pool.
DEBUG gremlin-server-worker-1 log-io - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] INACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] INACTIVE
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Executing shutdown LifeCycleHook
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] INACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] UNREGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb3534dcb, L:/127.0.0.1:45940 ! R:/127.0.0.1:60019] UNREGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] INACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] INACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] UNREGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xb4642a6e, L:/127.0.0.1:45940 ! R:/127.0.0.1:60018] UNREGISTERED
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 1 thread-local buffer(s) from thread: gremlin-server-exec-2
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 1 thread-local buffer(s) from thread: gremlin-server-exec-3
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [graph]
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [test_graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [test_graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Gremlin Server - shutdown complete
INFO main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Signalled closing of connection pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} with core size of 2
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 8 thread-local buffer(s) from thread: gremlin-server-worker-1
