WARN gremlin-server-exec-2 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Exception processing a script on request [RequestMessage{, requestId=09c285ea-39bd-47f8-9c21-2ad0e5a1c8d3, op='eval', processor='', args={gremlin=test.addV().property('name',personName), bindings={personName=Amine}, batchSize=64}}].
groovy.lang.MissingPropertyException: No such property: test for class: Script3
	at org.codehaus.groovy.runtime.ScriptBytecodeAdapter.unwrap(ScriptBytecodeAdapter.java:53)
	at org.codehaus.groovy.runtime.callsite.PogoGetPropertySite.getProperty(PogoGetPropertySite.java:52)
	at org.codehaus.groovy.runtime.callsite.AbstractCallSite.callGroovyObjectGetProperty(AbstractCallSite.java:307)
	at Script3.run(Script3.groovy:1)
	at org.apache.tinkerpop.gremlin.groovy.jsr223.GremlinGroovyScriptEngine.eval(GremlinGroovyScriptEngine.java:628)
	at org.apache.tinkerpop.gremlin.groovy.jsr223.GremlinGroovyScriptEngine.eval(GremlinGroovyScriptEngine.java:457)
	at javax.script.AbstractScriptEngine.eval(AbstractScriptEngine.java:233)
	at org.apache.tinkerpop.gremlin.groovy.engine.ScriptEngines.eval(ScriptEngines.java:120)
	at org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor.lambda$eval$2(GremlinExecutor.java:314)
	at java.util.concurrent.FutureTask.run(FutureTask.java:266)
	at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1142)
	at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:617)
	at java.lang.Thread.run(Thread.java:745)
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] WRITE: ResponseMessage{requestId=09c285ea-39bd-47f8-9c21-2ad0e5a1c8d3, status=ResponseStatus{code=SERVER_ERROR_SCRIPT_EVALUATION, message='No such property: test for class: Script3', attributes={}}, result=ResponseResult{data=null, meta={}}}
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] WRITE: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 65, cap: 65)), 65B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 01 09 c2 85 ea 39 bd 47 f8 9c 21 2a d0 e5 a1 c8 |.....9.G..!*....|
|00000010| d3 02 55 4e 6f 20 73 75 63 68 20 70 72 6f 70 65 |..UNo such prope|
|00000020| 72 74 79 3a 20 74 65 73 74 20 66 6f 72 20 63 6c |rty: test for cl|
|00000030| 61 73 73 3a 20 53 63 72 69 70 74 b3 36 01 00 36 |ass: Script.6..6|
|00000040| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=65
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] WRITE: 67B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 41 01 09 c2 85 ea 39 bd 47 f8 9c 21 2a d0 e5 |.A.....9.G..!*..|
|00000010| a1 c8 d3 02 55 4e 6f 20 73 75 63 68 20 70 72 6f |....UNo such pro|
|00000020| 70 65 72 74 79 3a 20 74 65 73 74 20 66 6f 72 20 |perty: test for |
|00000030| 63 6c 61 73 73 3a 20 53 63 72 69 70 74 b3 36 01 |class: Script.6.|
|00000040| 00 36 01                                        |.6.             |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] WRITE: 67B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 41 01 09 c2 85 ea 39 bd 47 f8 9c 21 2a d0 e5 |.A.....9.G..!*..|
|00000010| a1 c8 d3 02 55 4e 6f 20 73 75 63 68 20 70 72 6f |....UNo such pro|
|00000020| 70 65 72 74 79 3a 20 74 65 73 74 20 66 6f 72 20 |perty: test for |
|00000030| 63 6c 61 73 73 3a 20 53 63 72 69 70 74 b3 36 01 |class: Script.6.|
|00000040| 00 36 01                                        |.6.             |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] WRITE: 67B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 41 01 09 c2 85 ea 39 bd 47 f8 9c 21 2a d0 e5 |.A.....9.G..!*..|
|00000010| a1 c8 d3 02 55 4e 6f 20 73 75 63 68 20 70 72 6f |....UNo such pro|
|00000020| 70 65 72 74 79 3a 20 74 65 73 74 20 66 6f 72 20 |perty: test for |
|00000030| 63 6c 61 73 73 3a 20 53 63 72 69 70 74 b3 36 01 |class: Script.6.|
|00000040| 00 36 01                                        |.6.             |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0xa69f6d0d, L:/127.0.0.1:45940 - R:/127.0.0.1:59905] FLUSH
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - test.addV().property('name',personName) - as the eval completed (possibly with exception).
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=65
DEBUG gremlin-driver-loop-1 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Attempting to return Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG gremlin-driver-loop-1 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Announce connection available on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[session]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[control]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[traversal]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down thread pools.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Gremlin thread pool.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Worker thread pool.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Boss thread pool.
DEBUG gremlin-server-worker-1 log-io - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] INACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] INACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] UNREGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xa69f6d0d, L:/127.0.0.1:45940 ! R:/127.0.0.1:59905] UNREGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] INACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] INACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] UNREGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x55994cba, L:/127.0.0.1:45940 ! R:/127.0.0.1:59906] UNREGISTERED
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [graph]
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [test_graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [test_graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Gremlin Server - shutdown complete
INFO main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Signalled closing of connection pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} with core size of 2
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 6 thread-local buffer(s) from thread: gremlin-server-worker-1
DEBUG main io.netty.util.internal.logging.InternalLoggerFactory - Using SLF4J as the default logging framework
DEBUG main io.netty.channel.MultithreadEventLoopGroup - -Dio.netty.eventLoopThreads: 16
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.Buffer.address: available
DEBUG main io.netty.util.internal.PlatformDependent0 - sun.misc.Unsafe.theUnsafe: available
DEBUG main io.netty.util.internal.PlatformDependent0 - sun.misc.Unsafe.copyMemory: available
DEBUG main io.netty.util.internal.PlatformDependent0 - direct buffer constructor: available
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.Bits.unaligned: available, true
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.DirectByteBuffer.<init>(long, int): available
DEBUG main io.netty.util.internal.Cleaner0 - java.nio.ByteBuffer.cleaner(): available
DEBUG main io.netty.util.internal.PlatformDependent - Java version: 8
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noUnsafe: false
DEBUG main io.netty.util.internal.PlatformDependent - sun.misc.Unsafe: available
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noJavassist: false
DEBUG main io.netty.util.internal.PlatformDependent - Javassist: unavailable
DEBUG main io.netty.util.internal.PlatformDependent - You don't have Javassist in your class path or you don't have enough permission to load dynamically generated classes.  Please check the configuration for better performance.
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.tmpdir: /var/folders/nq/kbh848m57f99nh511y49kysw0000gn/T (java.io.tmpdir)
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.bitMode: 64 (sun.arch.data.model)
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noPreferDirect: false
DEBUG main io.netty.util.internal.PlatformDependent - io.netty.maxDirectMemory: 1908932608 bytes
DEBUG main io.netty.channel.nio.NioEventLoop - -Dio.netty.noKeySetOptimization: false
DEBUG main io.netty.channel.nio.NioEventLoop - -Dio.netty.selectorAutoRebuildThreshold: 512
DEBUG main io.netty.util.internal.PlatformDependent - org.jctools-core.MpscChunkedArrayQueue: available
INFO main org.apache.tinkerpop.gremlin.server.util.MetricManager - Configured Metrics Slf4jReporter configured with interval=180000ms and loggerName=org.apache.tinkerpop.gremlin.server.Settings$Slf4jReporterMetrics
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - FileName set to tinkergraph-empty.properties
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - Base path set to /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - ConfigurationUtils.locate(): base is /Users/aelmanaa/Applications/app/conf, name is tinkergraph-empty.properties
DEBUG main org.apache.commons.configuration.DefaultFileSystem - Could not locate file tinkergraph-empty.properties at /Users/aelmanaa/Applications/app/conf: no protocol: /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - Loading configuration from the path /Users/aelmanaa/Applications/app/conf/tinkergraph-empty.properties
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Graph [graph] was successfully configured via [conf/tinkergraph-empty.properties].
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - FileName set to tinkergraph-test.properties
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - Base path set to /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - ConfigurationUtils.locate(): base is /Users/aelmanaa/Applications/app/conf, name is tinkergraph-test.properties
DEBUG main org.apache.commons.configuration.DefaultFileSystem - Could not locate file tinkergraph-test.properties at /Users/aelmanaa/Applications/app/conf: no protocol: /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - Loading configuration from the path /Users/aelmanaa/Applications/app/conf/tinkergraph-test.properties
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Graph [test_graph] was successfully configured via [conf/tinkergraph-test.properties].
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - Initialized Gremlin thread pool.  Threads in pool named with pattern gremlin-*
INFO main org.apache.tinkerpop.gremlin.groovy.engine.ScriptEngines - Loaded gremlin-groovy ScriptEngine
INFO main org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Initialized gremlin-groovy ScriptEngine with scripts/generate-modern.groovy
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - Initialized GremlinExecutor and configured ScriptEngines.
DEBUG main org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Preparing to evaluate script - 1+1 - in thread [main]
DEBUG gremlin-server-exec-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Schedule timeout for script - 1+1 - in thread [gremlin-server-exec-1]
DEBUG gremlin-server-exec-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Evaluating script - 1+1 - in thread [gremlin-server-exec-1]
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - 1+1 - as the eval completed (possibly with exception).
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - A GraphTraversalSource is now bound to [test] with graphtraversalsource[tinkergraph[vertices:0 edges:0], standard]
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - A GraphTraversalSource is now bound to [g] with graphtraversalsource[tinkergraph[vertices:0 edges:0], standard]
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the standard OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the control OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the session OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the traversal OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.traversal.TraversalOpProcessor - Initialized cache for TraversalOpProcessor with size 1000 and expiration time of 600000 ms
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.numHeapArenas: 16
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.numDirectArenas: 16
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.pageSize: 8192
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.maxOrder: 11
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.chunkSize: 16777216
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.tinyCacheSize: 512
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.smallCacheSize: 256
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.normalCacheSize: 64
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.maxCachedBufferCapacity: 32768
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.cacheTrimInterval: 8192
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Executing start up LifeCycleHook
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Loading 'modern' graph data.
INFO main org.apache.tinkerpop.gremlin.server.AbstractChannelizer - Configured application/vnd.gremlin-v1.0+gryo with org.apache.tinkerpop.gremlin.driver.ser.GryoMessageSerializerV1d0
INFO main org.apache.tinkerpop.gremlin.server.AbstractChannelizer - Configured application/vnd.gremlin-v1.0+gryo-stringd with org.apache.tinkerpop.gremlin.driver.ser.GryoMessageSerializerV1d0
DEBUG main io.netty.util.internal.ThreadLocalRandom - -Dio.netty.initialSeedUniquifier: 0xa44f19b16d02c32b (took 0 ms)
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.allocator.type: unpooled
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.threadLocalDirectBufferSize: 65536
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.maxThreadLocalCharBufferSize: 16384
DEBUG main io.netty.util.NetUtil - Loopback interface: lo0 (lo0, 0:0:0:0:0:0:0:1)
DEBUG main io.netty.util.NetUtil - /proc/sys/net/core/somaxconn: 128 (non-existent)
INFO gremlin-server-boss-1 org.apache.tinkerpop.gremlin.server.GremlinServer - Gremlin Server configured with worker thread pool of 1, gremlin pool of 8 and boss thread pool of 1.
INFO gremlin-server-boss-1 org.apache.tinkerpop.gremlin.server.GremlinServer - Channel started at port 45940.
DEBUG main org.apache.tinkerpop.gremlin.driver.Client - Initializing client on cluster [localhost/127.0.0.1:45940]
DEBUG gremlin-driver-loop-1 io.netty.buffer.AbstractByteBuf - -Dio.netty.buffer.bytebuf.checkAccessible: true
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetector - -Dio.netty.leakDetection.level: simple
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetector - -Dio.netty.leakDetection.maxRecords: 4
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetectorFactory - Loaded default ResourceLeakDetector: io.netty.util.ResourceLeakDetector@559948b7
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpRequestDecoder settings - maxInitialLineLength=4096, maxHeaderSize=8192, maxChunkSize=8192
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpObjectAggregator settings - maxContentLength=65536, maxAccumulationBufferComponents=1024
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocketClientHandshaker13 - WebSocket version 13 client handshake key: omMNC4vH3fqfPgytt3zRjA==, expected response: 5CNEzVKq+TCN6DcMk1AAOX+JuFM=
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] REGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] REGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] ACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] ACTIVE
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.maxCapacity.default: 32768
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.maxSharedCapacityFactor: 2
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.linkCapacity: 16
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.ratio: 8
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: 207B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 47 45 54 20 2f 67 72 65 6d 6c 69 6e 20 48 54 54 |GET /gremlin HTT|
|00000010| 50 2f 31 2e 31 0d 0a 55 70 67 72 61 64 65 3a 20 |P/1.1..Upgrade: |
|00000020| 57 65 62 53 6f 63 6b 65 74 0d 0a 43 6f 6e 6e 65 |WebSocket..Conne|
|00000030| 63 74 69 6f 6e 3a 20 55 70 67 72 61 64 65 0d 0a |ction: Upgrade..|
|00000040| 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d 4b 65 |Sec-WebSocket-Ke|
|00000050| 79 3a 20 6f 6d 4d 4e 43 34 76 48 33 66 71 66 50 |y: omMNC4vH3fqfP|
|00000060| 67 79 74 74 33 7a 52 6a 41 3d 3d 0d 0a 48 6f 73 |gytt3zRjA==..Hos|
|00000070| 74 3a 20 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 |t: localhost:459|
|00000080| 34 30 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 |40..Sec-WebSocke|
|00000090| 74 2d 4f 72 69 67 69 6e 3a 20 68 74 74 70 3a 2f |t-Origin: http:/|
|000000a0| 2f 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 34 30 |/localhost:45940|
|000000b0| 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d |..Sec-WebSocket-|
|000000c0| 56 65 72 73 69 6f 6e 3a 20 31 33 0d 0a 0d 0a    |Version: 13.... |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: DefaultHttpRequest(decodeResult: success, version: HTTP/1.1)
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: omMNC4vH3fqfPgytt3zRjA==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED, EmptyLastHttpContent, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED, HttpObjectAggregator$AggregatedFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: CompositeByteBuf(ridx: 0, widx: 0, cap: 0, components=0))
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: omMNC4vH3fqfPgytt3zRjA==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
Content-Length: 0, 0B
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WebSocket version V13 server handshake
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - WebSocket version 13 server handshake key: omMNC4vH3fqfPgytt3zRjA==, response: 5CNEzVKq+TCN6DcMk1AAOX+JuFM=
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: 5CNEzVKq+TCN6DcMk1AAOX+JuFM=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: 5CNEzVKq+TCN6DcMk1AAOX+JuFM=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 35 43 4e 45 7a 56 4b 71 2b 54 43 4e 36 44 63 | 5CNEzVKq+TCN6Dc|
|00000070| 4d 6b 31 41 41 4f 58 2b 4a 75 46 4d 3d 0d 0a 0d |Mk1AAOX+JuFM=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 35 43 4e 45 7a 56 4b 71 2b 54 43 4e 36 44 63 | 5CNEzVKq+TCN6Dc|
|00000070| 4d 6b 31 41 41 4f 58 2b 4a 75 46 4d 3d 0d 0a 0d |Mk1AAOX+JuFM=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 35 43 4e 45 7a 56 4b 71 2b 54 43 4e 36 44 63 | 5CNEzVKq+TCN6Dc|
|00000070| 4d 6b 31 41 41 4f 58 2b 4a 75 46 4d 3d 0d 0a 0d |Mk1AAOX+JuFM=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] USER_EVENT: HANDSHAKE_COMPLETE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] USER_EVENT: HANDSHAKE_COMPLETE
INFO main org.apache.tinkerpop.gremlin.driver.Connection - Created new connection for ws://localhost:45940/gremlin
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpRequestDecoder settings - maxInitialLineLength=4096, maxHeaderSize=8192, maxChunkSize=8192
DEBUG gremlin-driver-loop-2 io.netty.handler.codec.http.websocketx.WebSocketClientHandshaker13 - WebSocket version 13 client handshake key: 3Cz7asuYMe+ttjPVaYT9Jw==, expected response: aomLOquW06kRK2cWeDc6lARlm3k=
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpObjectAggregator settings - maxContentLength=65536, maxAccumulationBufferComponents=1024
DEBUG gremlin-server-worker-1 log-io - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] REGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] REGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] ACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] ACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] RECEIVED: 207B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 47 45 54 20 2f 67 72 65 6d 6c 69 6e 20 48 54 54 |GET /gremlin HTT|
|00000010| 50 2f 31 2e 31 0d 0a 55 70 67 72 61 64 65 3a 20 |P/1.1..Upgrade: |
|00000020| 57 65 62 53 6f 63 6b 65 74 0d 0a 43 6f 6e 6e 65 |WebSocket..Conne|
|00000030| 63 74 69 6f 6e 3a 20 55 70 67 72 61 64 65 0d 0a |ction: Upgrade..|
|00000040| 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d 4b 65 |Sec-WebSocket-Ke|
|00000050| 79 3a 20 33 43 7a 37 61 73 75 59 4d 65 2b 74 74 |y: 3Cz7asuYMe+tt|
|00000060| 6a 50 56 61 59 54 39 4a 77 3d 3d 0d 0a 48 6f 73 |jPVaYT9Jw==..Hos|
|00000070| 74 3a 20 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 |t: localhost:459|
|00000080| 34 30 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 |40..Sec-WebSocke|
|00000090| 74 2d 4f 72 69 67 69 6e 3a 20 68 74 74 70 3a 2f |t-Origin: http:/|
|000000a0| 2f 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 34 30 |/localhost:45940|
|000000b0| 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d |..Sec-WebSocket-|
|000000c0| 56 65 72 73 69 6f 6e 3a 20 31 33 0d 0a 0d 0a    |Version: 13.... |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] RECEIVED: DefaultHttpRequest(decodeResult: success, version: HTTP/1.1)
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: 3Cz7asuYMe+ttjPVaYT9Jw==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] RECEIVED, EmptyLastHttpContent, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] RECEIVED, HttpObjectAggregator$AggregatedFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: CompositeByteBuf(ridx: 0, widx: 0, cap: 0, components=0))
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: 3Cz7asuYMe+ttjPVaYT9Jw==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
Content-Length: 0, 0B
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] WebSocket version V13 server handshake
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - WebSocket version 13 server handshake key: 3Cz7asuYMe+ttjPVaYT9Jw==, response: aomLOquW06kRK2cWeDc6lARlm3k=
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: aomLOquW06kRK2cWeDc6lARlm3k=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: aomLOquW06kRK2cWeDc6lARlm3k=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 61 6f 6d 4c 4f 71 75 57 30 36 6b 52 4b 32 63 | aomLOquW06kRK2c|
|00000070| 57 65 44 63 36 6c 41 52 6c 6d 33 6b 3d 0d 0a 0d |WeDc6lARlm3k=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 61 6f 6d 4c 4f 71 75 57 30 36 6b 52 4b 32 63 | aomLOquW06kRK2c|
|00000070| 57 65 44 63 36 6c 41 52 6c 6d 33 6b 3d 0d 0a 0d |WeDc6lARlm3k=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 61 6f 6d 4c 4f 71 75 57 30 36 6b 52 4b 32 63 | aomLOquW06kRK2c|
|00000070| 57 65 44 63 36 6c 41 52 6c 6d 33 6b 3d 0d 0a 0d |WeDc6lARlm3k=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] USER_EVENT: HANDSHAKE_COMPLETE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 - R:/127.0.0.1:59960] USER_EVENT: HANDSHAKE_COMPLETE
INFO main org.apache.tinkerpop.gremlin.driver.Connection - Created new connection for ws://localhost:45940/gremlin
INFO main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Opening connection pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} with core size of 2
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Borrowing connection from pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} - timeout in 3000 MILLISECONDS
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Return least used Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}, isDead=false, borrowed=1, pending=0} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG main org.apache.tinkerpop.gremlin.driver.Client - Submitted RequestMessage{, requestId=722b9ab9-8f48-46ed-abab-454a34148c8d, op='eval', processor='', args={batchSize=64, gremlin=test.addV().property('name',personName), bindings={personName=Amine}}} to - Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}}
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=154
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: 162B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 fe 00 9a 3d 40 49 72 1c 21 39 02 51 29 2a 13 |....=@Ir.!9.Q)*.|
|00000010| 49 29 26 1c 12 36 27 16 13 27 3b 17 50 2c 20 1c |I)&..6'..';.P, .|
|00000020| 10 36 78 5c 0d 6b 2e 00 44 2f 48 00 16 da f0 fd |.6x\.k..D/H.....|
|00000030| 75 06 a4 d9 96 05 03 46 29 cc c4 f3 58 36 28 9e |u......F)...X6(.|
|00000040| 3c 43 4a 73 5f 21 3d 11 55 13 20 08 d8 42 c9 73 |<CJs_!=.U. ..B.s|
|00000050| 3e 41 2e 00 58 2d 25 1b d3 43 48 06 58 33 3d 5c |>A..X-%..CH.X3=\|
|00000060| 5c 24 2d 24 15 69 67 02 4f 2f 39 17 4f 34 30 5a |\$-$.ig.O/9.O40Z|
|00000070| 1a 2e 28 1f 58 67 65 02 58 32 3a 1d 53 0e 28 1f |..(.Xge.X2:.S.(.|
|00000080| 58 e9 4a 73 5f 29 27 16 54 2e 2e 81 30 41 48 71 |X.Js_)'.T...0AHq|
|00000090| 3c 30 2c 00 4e 2f 27 3c 5c 2d ac 71 3c 01 24 1b |<0,.N/'<\-.q<.$.|
|000000a0| 53 a5                                           |S.              |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=154
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 154, cap: 154)), 154B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 72 2b 9a b9 8f 48 46 ed ab ab 45 4a 34 |yo.r+...HF...EJ4|
|00000030| 14 8c 8d 81 65 76 61 ec 01 03 03 01 62 61 74 63 |....eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 74 65 73 74 2e 61 64 64 56 28 29 2e 70 |...test.addV().p|
|00000060| 72 6f 70 65 72 74 79 28 27 6e 61 6d 65 27 2c 70 |roperty('name',p|
|00000070| 65 72 73 6f 6e 4e 61 6d 65 a9 03 01 62 69 6e 64 |ersonName...bind|
|00000080| 69 6e 67 f3 0d 01 01 03 01 70 65 72 73 6f 6e 4e |ing......personN|
|00000090| 61 6d e5 03 01 41 6d 69 6e e5                   |am...Amin.      |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 154, cap: 154)), 154B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 72 2b 9a b9 8f 48 46 ed ab ab 45 4a 34 |yo.r+...HF...EJ4|
|00000030| 14 8c 8d 81 65 76 61 ec 01 03 03 01 62 61 74 63 |....eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 74 65 73 74 2e 61 64 64 56 28 29 2e 70 |...test.addV().p|
|00000060| 72 6f 70 65 72 74 79 28 27 6e 61 6d 65 27 2c 70 |roperty('name',p|
|00000070| 65 72 73 6f 6e 4e 61 6d 65 a9 03 01 62 69 6e 64 |ersonName...bind|
|00000080| 69 6e 67 f3 0d 01 01 03 01 70 65 72 73 6f 6e 4e |ing......personN|
|00000090| 61 6d e5 03 01 41 6d 69 6e e5                   |am...Amin.      |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 154, cap: 154)), 154B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 72 2b 9a b9 8f 48 46 ed ab ab 45 4a 34 |yo.r+...HF...EJ4|
|00000030| 14 8c 8d 81 65 76 61 ec 01 03 03 01 62 61 74 63 |....eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 74 65 73 74 2e 61 64 64 56 28 29 2e 70 |...test.addV().p|
|00000060| 72 6f 70 65 72 74 79 28 27 6e 61 6d 65 27 2c 70 |roperty('name',p|
|00000070| 65 72 73 6f 6e 4e 61 6d 65 a9 03 01 62 69 6e 64 |ersonName...bind|
|00000080| 69 6e 67 f3 0d 01 01 03 01 70 65 72 73 6f 6e 4e |ing......personN|
|00000090| 61 6d e5 03 01 41 6d 69 6e e5                   |am...Amin.      |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: RequestMessage{, requestId=722b9ab9-8f48-46ed-abab-454a34148c8d, op='eval', processor='', args={gremlin=test.addV().property('name',personName), bindings={personName=Amine}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Selecting processor for RequestMessage RequestMessage{, requestId=722b9ab9-8f48-46ed-abab-454a34148c8d, op='eval', processor='', args={gremlin=test.addV().property('name',personName), bindings={personName=Amine}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.standard.StandardOpProcessor - Sessionless request 722b9ab9-8f48-46ed-abab-454a34148c8d for eval in thread gremlin-server-worker-1
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Preparing to evaluate script - test.addV().property('name',personName) - in thread [gremlin-server-worker-1]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Schedule timeout for script - test.addV().property('name',personName) - in thread [gremlin-server-exec-2]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Evaluating script - test.addV().property('name',personName) - in thread [gremlin-server-exec-2]
DEBUG gremlin-server-exec-2 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Preparing to iterate results from - RequestMessage{, requestId=722b9ab9-8f48-46ed-abab-454a34148c8d, op='eval', processor='', args={gremlin=test.addV().property('name',personName), bindings={personName=Amine}, batchSize=64}} - in thread [gremlin-server-exec-2]
INFO gremlin-server-exec-2 com.my.ExampleMutationListener - AMINE vertexAdded!!!!! v[bf664eff-a80a-42f5-81a2-b91d10caf1cf]
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: org.apache.tinkerpop.gremlin.server.handler.Frame@3c745a7
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 80, cap: 80)), 80B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 01 72 2b 9a b9 8f 48 46 ed ab ab 45 4a 34 14 8c |.r+...HF...EJ4..|
|00000010| 8d 00 c8 81 36 01 0c 01 01 44 01 15 01 13 01 bf |....6....D......|
|00000020| 66 4e ff a8 0a 42 f5 81 a2 b9 1d 10 ca f1 cf 01 |fN...B..........|
|00000030| 76 65 72 74 65 f8 0d 01 01 01 6e 61 6d e5 0c 01 |verte.....nam...|
|00000040| 01 16 01 09 04 08 00 03 01 41 6d 69 6e e5 36 01 |.........Amin.6.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=80
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 82B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 50 01 72 2b 9a b9 8f 48 46 ed ab ab 45 4a 34 |.P.r+...HF...EJ4|
|00000010| 14 8c 8d 00 c8 81 36 01 0c 01 01 44 01 15 01 13 |......6....D....|
|00000020| 01 bf 66 4e ff a8 0a 42 f5 81 a2 b9 1d 10 ca f1 |..fN...B........|
|00000030| cf 01 76 65 72 74 65 f8 0d 01 01 01 6e 61 6d e5 |..verte.....nam.|
|00000040| 0c 01 01 16 01 09 04 08 00 03 01 41 6d 69 6e e5 |...........Amin.|
|00000050| 36 01                                           |6.              |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 82B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 50 01 72 2b 9a b9 8f 48 46 ed ab ab 45 4a 34 |.P.r+...HF...EJ4|
|00000010| 14 8c 8d 00 c8 81 36 01 0c 01 01 44 01 15 01 13 |......6....D....|
|00000020| 01 bf 66 4e ff a8 0a 42 f5 81 a2 b9 1d 10 ca f1 |..fN...B........|
|00000030| cf 01 76 65 72 74 65 f8 0d 01 01 01 6e 61 6d e5 |..verte.....nam.|
|00000040| 0c 01 01 16 01 09 04 08 00 03 01 41 6d 69 6e e5 |...........Amin.|
|00000050| 36 01                                           |6.              |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 82B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 50 01 72 2b 9a b9 8f 48 46 ed ab ab 45 4a 34 |.P.r+...HF...EJ4|
|00000010| 14 8c 8d 00 c8 81 36 01 0c 01 01 44 01 15 01 13 |......6....D....|
|00000020| 01 bf 66 4e ff a8 0a 42 f5 81 a2 b9 1d 10 ca f1 |..fN...B........|
|00000030| cf 01 76 65 72 74 65 f8 0d 01 01 01 6e 61 6d e5 |..verte.....nam.|
|00000040| 0c 01 01 16 01 09 04 08 00 03 01 41 6d 69 6e e5 |...........Amin.|
|00000050| 36 01                                           |6.              |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - test.addV().property('name',personName) - as the eval completed (possibly with exception).
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=80
DEBUG gremlin-driver-worker-1 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Attempting to return Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG gremlin-driver-worker-1 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Announce connection available on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Borrowing connection from pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} - timeout in 3000 MILLISECONDS
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Return least used Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}, isDead=false, borrowed=1, pending=0} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG main org.apache.tinkerpop.gremlin.driver.Client - Submitted RequestMessage{, requestId=f8ecdceb-f1bb-4a60-a17d-b93800110504, op='eval', processor='', args={batchSize=64, gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}}} to - Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}}
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=176
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: 184B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 fe 00 b0 44 54 df 63 65 35 af 13 28 3d bc 02 |....DT.ce5..(=..|
|00000010| 30 3d b0 0d 6b 22 b1 07 6a 33 ad 06 29 38 b6 0d |0=..k"..j3..)8..|
|00000020| 69 22 ee 4d 74 7f b8 11 3d 3b de 9b a8 88 34 92 |i".Mt...=;....4.|
|00000030| ff 1e bf c2 39 ed e7 63 55 51 db e2 21 22 be 8f |....9..cUQ..!"..|
|00000040| 45 57 dc 62 26 35 ab 00 2c 07 b6 19 a1 56 5f 62 |EW.b&5..,....V_b|
|00000050| 47 55 b8 11 21 39 b3 0a aa 57 de a5 45 33 f1 35 |GU..!9...W..E3.5|
|00000060| 6c 7d f1 0b 25 27 93 02 26 31 b3 4b 63 27 b0 05 |l}..%'..&1.Kc'..|
|00000070| 30 23 be 11 21 73 f6 4d 2c 35 ac 4b 63 3a be 0e |0#..!s.M,5.Kc:..|
|00000080| 21 73 f3 0d 6d 7a b6 0d 6c 73 bc 11 21 35 ab 06 |!s..mz..ls..!5..|
|00000090| 20 73 f6 4d 32 35 b3 16 21 27 f7 44 2a 35 b2 06 | s.M25..!'.D*5..|
|000000a0| 63 7d dc 62 26 3d b1 07 2d 3a b8 90 49 55 de 60 |c}.b&=..-:..IU.`|
|000000b0| 45 d6 b1 60 45 38 b0 93                         |E..`E8..        |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=176
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 f8 ec dc eb f1 bb 4a 60 a1 7d b9 38 00 |yo.......J`.}.8.|
|00000030| 11 05 04 81 65 76 61 ec 01 03 03 01 62 61 74 63 |....eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 f8 ec dc eb f1 bb 4a 60 a1 7d b9 38 00 |yo.......J`.}.8.|
|00000030| 11 05 04 81 65 76 61 ec 01 03 03 01 62 61 74 63 |....eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 176, cap: 176)), 176B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 21 61 70 70 6c 69 63 61 74 69 6f 6e 2f 76 6e 64 |!application/vnd|
|00000010| 2e 67 72 65 6d 6c 69 6e 2d 76 31 2e 30 2b 67 72 |.gremlin-v1.0+gr|
|00000020| 79 6f 01 f8 ec dc eb f1 bb 4a 60 a1 7d b9 38 00 |yo.......J`.}.8.|
|00000030| 11 05 04 81 65 76 61 ec 01 03 03 01 62 61 74 63 |....eva.....batc|
|00000040| 68 53 69 7a e5 02 80 01 03 01 67 72 65 6d 6c 69 |hSiz......gremli|
|00000050| ee 03 01 c6 01 67 2e 56 28 29 2e 68 61 73 4c 61 |.....g.V().hasLa|
|00000060| 62 65 6c 28 27 73 6f 66 74 77 61 72 65 27 29 2e |bel('software').|
|00000070| 68 61 73 28 27 6e 61 6d 65 27 2c 6e 29 2e 69 6e |has('name',n).in|
|00000080| 28 27 63 72 65 61 74 65 64 27 29 2e 76 61 6c 75 |('created').valu|
|00000090| 65 73 28 27 6e 61 6d 65 27 29 03 01 62 69 6e 64 |es('name')..bind|
|000000a0| 69 6e 67 f3 0d 01 01 03 01 82 6e 03 01 6c 6f f0 |ing.......n..lo.|
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] RECEIVED: RequestMessage{, requestId=f8ecdceb-f1bb-4a60-a17d-b93800110504, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Selecting processor for RequestMessage RequestMessage{, requestId=f8ecdceb-f1bb-4a60-a17d-b93800110504, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}}
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.op.standard.StandardOpProcessor - Sessionless request f8ecdceb-f1bb-4a60-a17d-b93800110504 for eval in thread gremlin-server-worker-1
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Preparing to evaluate script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-worker-1]
DEBUG gremlin-server-exec-3 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Schedule timeout for script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-exec-3]
DEBUG gremlin-server-exec-3 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Evaluating script - g.V().hasLabel('software').has('name',n).in('created').values('name') - in thread [gremlin-server-exec-3]
DEBUG gremlin-server-exec-3 org.apache.tinkerpop.gremlin.server.op.AbstractEvalOpProcessor - Preparing to iterate results from - RequestMessage{, requestId=f8ecdceb-f1bb-4a60-a17d-b93800110504, op='eval', processor='', args={gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}, batchSize=64}} - in thread [gremlin-server-exec-3]
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: org.apache.tinkerpop.gremlin.server.handler.Frame@20a21061
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: BinaryWebSocketFrame(data: PooledUnsafeDirectByteBuf(ridx: 0, widx: 47, cap: 47)), 47B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 01 f8 ec dc eb f1 bb 4a 60 a1 7d b9 38 00 11 05 |.......J`.}.8...|
|00000010| 04 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 6b ef |....6......mark.|
|00000020| 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 01    |..jos...pete.6. |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=47
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 f8 ec dc eb f1 bb 4a 60 a1 7d b9 38 00 |./.......J`.}.8.|
|00000010| 11 05 04 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |......6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 f8 ec dc eb f1 bb 4a 60 a1 7d b9 38 00 |./.......J`.}.8.|
|00000010| 11 05 04 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |......6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] WRITE: 49B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 2f 01 f8 ec dc eb f1 bb 4a 60 a1 7d b9 38 00 |./.......J`.}.8.|
|00000010| 11 05 04 00 c8 81 36 01 0c 01 03 03 01 6d 61 72 |......6......mar|
|00000020| 6b ef 03 01 6a 6f 73 e8 03 01 70 65 74 65 f2 36 |k...jos...pete.6|
|00000030| 01                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 - R:/127.0.0.1:59959] FLUSH
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - g.V().hasLabel('software').has('name',n).in('created').values('name') - as the eval completed (possibly with exception).
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame opCode=2
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameDecoder - Decoding WebSocket Frame length=47
DEBUG gremlin-driver-worker-5 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Attempting to return Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG gremlin-driver-worker-5 org.apache.tinkerpop.gremlin.driver.ConnectionPool - Announce connection available on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[session]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[control]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down OpProcessor[traversal]
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutting down thread pools.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Gremlin thread pool.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Worker thread pool.
DEBUG main org.apache.tinkerpop.gremlin.server.GremlinServer - Shutdown Boss thread pool.
DEBUG gremlin-server-worker-1 log-io - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] INACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] INACTIVE
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Executing shutdown LifeCycleHook
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] INACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] UNREGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x733c5f58, L:/127.0.0.1:45940 ! R:/127.0.0.1:59960] UNREGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] INACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] INACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] INACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] UNREGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] UNREGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0xcc4020ff, L:/127.0.0.1:45940 ! R:/127.0.0.1:59959] UNREGISTERED
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 1 thread-local buffer(s) from thread: gremlin-server-exec-2
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 1 thread-local buffer(s) from thread: gremlin-server-exec-3
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [mou]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [mou]
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [graph]
DEBUG gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closing Graph instance [test_graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Closed Graph instance [test_graph]
INFO gremlin-server-stop org.apache.tinkerpop.gremlin.server.GremlinServer - Gremlin Server - shutdown complete
INFO main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Signalled closing of connection pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} with core size of 2
DEBUG threadDeathWatcher-2-1 io.netty.buffer.PoolThreadCache - Freed 8 thread-local buffer(s) from thread: gremlin-server-worker-1
DEBUG main io.netty.util.internal.logging.InternalLoggerFactory - Using SLF4J as the default logging framework
DEBUG main io.netty.channel.MultithreadEventLoopGroup - -Dio.netty.eventLoopThreads: 16
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.Buffer.address: available
DEBUG main io.netty.util.internal.PlatformDependent0 - sun.misc.Unsafe.theUnsafe: available
DEBUG main io.netty.util.internal.PlatformDependent0 - sun.misc.Unsafe.copyMemory: available
DEBUG main io.netty.util.internal.PlatformDependent0 - direct buffer constructor: available
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.Bits.unaligned: available, true
DEBUG main io.netty.util.internal.PlatformDependent0 - java.nio.DirectByteBuffer.<init>(long, int): available
DEBUG main io.netty.util.internal.Cleaner0 - java.nio.ByteBuffer.cleaner(): available
DEBUG main io.netty.util.internal.PlatformDependent - Java version: 8
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noUnsafe: false
DEBUG main io.netty.util.internal.PlatformDependent - sun.misc.Unsafe: available
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noJavassist: false
DEBUG main io.netty.util.internal.PlatformDependent - Javassist: unavailable
DEBUG main io.netty.util.internal.PlatformDependent - You don't have Javassist in your class path or you don't have enough permission to load dynamically generated classes.  Please check the configuration for better performance.
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.tmpdir: /var/folders/nq/kbh848m57f99nh511y49kysw0000gn/T (java.io.tmpdir)
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.bitMode: 64 (sun.arch.data.model)
DEBUG main io.netty.util.internal.PlatformDependent - -Dio.netty.noPreferDirect: false
DEBUG main io.netty.util.internal.PlatformDependent - io.netty.maxDirectMemory: 1908932608 bytes
DEBUG main io.netty.channel.nio.NioEventLoop - -Dio.netty.noKeySetOptimization: false
DEBUG main io.netty.channel.nio.NioEventLoop - -Dio.netty.selectorAutoRebuildThreshold: 512
DEBUG main io.netty.util.internal.PlatformDependent - org.jctools-core.MpscChunkedArrayQueue: available
INFO main org.apache.tinkerpop.gremlin.server.util.MetricManager - Configured Metrics Slf4jReporter configured with interval=180000ms and loggerName=org.apache.tinkerpop.gremlin.server.Settings$Slf4jReporterMetrics
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - FileName set to tinkergraph-empty.properties
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - Base path set to /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - ConfigurationUtils.locate(): base is /Users/aelmanaa/Applications/app/conf, name is tinkergraph-empty.properties
DEBUG main org.apache.commons.configuration.DefaultFileSystem - Could not locate file tinkergraph-empty.properties at /Users/aelmanaa/Applications/app/conf: no protocol: /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - Loading configuration from the path /Users/aelmanaa/Applications/app/conf/tinkergraph-empty.properties
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Graph [graph] was successfully configured via [conf/tinkergraph-empty.properties].
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - FileName set to tinkergraph-test.properties
DEBUG main org.apache.commons.configuration.PropertiesConfiguration - Base path set to /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - ConfigurationUtils.locate(): base is /Users/aelmanaa/Applications/app/conf, name is tinkergraph-test.properties
DEBUG main org.apache.commons.configuration.DefaultFileSystem - Could not locate file tinkergraph-test.properties at /Users/aelmanaa/Applications/app/conf: no protocol: /Users/aelmanaa/Applications/app/conf
DEBUG main org.apache.commons.configuration.ConfigurationUtils - Loading configuration from the path /Users/aelmanaa/Applications/app/conf/tinkergraph-test.properties
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Graph [test_graph] was successfully configured via [conf/tinkergraph-test.properties].
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - Initialized Gremlin thread pool.  Threads in pool named with pattern gremlin-*
INFO main org.apache.tinkerpop.gremlin.groovy.engine.ScriptEngines - Loaded gremlin-groovy ScriptEngine
INFO main org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Initialized gremlin-groovy ScriptEngine with scripts/generate-modern.groovy
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - Initialized GremlinExecutor and configured ScriptEngines.
DEBUG main org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Preparing to evaluate script - 1+1 - in thread [main]
DEBUG gremlin-server-exec-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Schedule timeout for script - 1+1 - in thread [gremlin-server-exec-1]
DEBUG gremlin-server-exec-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Evaluating script - 1+1 - in thread [gremlin-server-exec-1]
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.groovy.engine.GremlinExecutor - Killing scheduled timeout on script evaluation - 1+1 - as the eval completed (possibly with exception).
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - A GraphTraversalSource is now bound to [test] with graphtraversalsource[tinkergraph[vertices:0 edges:0], standard]
INFO main org.apache.tinkerpop.gremlin.server.util.ServerGremlinExecutor - A GraphTraversalSource is now bound to [g] with graphtraversalsource[tinkergraph[vertices:0 edges:0], standard]
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the standard OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the control OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the session OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.OpLoader - Adding the traversal OpProcessor.
INFO main org.apache.tinkerpop.gremlin.server.op.traversal.TraversalOpProcessor - Initialized cache for TraversalOpProcessor with size 1000 and expiration time of 600000 ms
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.numHeapArenas: 16
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.numDirectArenas: 16
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.pageSize: 8192
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.maxOrder: 11
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.chunkSize: 16777216
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.tinyCacheSize: 512
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.smallCacheSize: 256
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.normalCacheSize: 64
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.maxCachedBufferCapacity: 32768
DEBUG main io.netty.buffer.PooledByteBufAllocator - -Dio.netty.allocator.cacheTrimInterval: 8192
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Executing start up LifeCycleHook
INFO main org.apache.tinkerpop.gremlin.server.GremlinServer - Loading 'modern' graph data.
INFO main org.apache.tinkerpop.gremlin.server.AbstractChannelizer - Configured application/vnd.gremlin-v1.0+gryo with org.apache.tinkerpop.gremlin.driver.ser.GryoMessageSerializerV1d0
INFO main org.apache.tinkerpop.gremlin.server.AbstractChannelizer - Configured application/vnd.gremlin-v1.0+gryo-stringd with org.apache.tinkerpop.gremlin.driver.ser.GryoMessageSerializerV1d0
DEBUG main io.netty.util.internal.ThreadLocalRandom - -Dio.netty.initialSeedUniquifier: 0xf1d5011e0a543974 (took 0 ms)
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.allocator.type: unpooled
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.threadLocalDirectBufferSize: 65536
DEBUG main io.netty.buffer.ByteBufUtil - -Dio.netty.maxThreadLocalCharBufferSize: 16384
DEBUG main io.netty.util.NetUtil - Loopback interface: lo0 (lo0, 0:0:0:0:0:0:0:1)
DEBUG main io.netty.util.NetUtil - /proc/sys/net/core/somaxconn: 128 (non-existent)
INFO gremlin-server-boss-1 org.apache.tinkerpop.gremlin.server.GremlinServer - Gremlin Server configured with worker thread pool of 1, gremlin pool of 8 and boss thread pool of 1.
INFO gremlin-server-boss-1 org.apache.tinkerpop.gremlin.server.GremlinServer - Channel started at port 45940.
DEBUG main org.apache.tinkerpop.gremlin.driver.Client - Initializing client on cluster [localhost/127.0.0.1:45940]
DEBUG gremlin-driver-loop-1 io.netty.buffer.AbstractByteBuf - -Dio.netty.buffer.bytebuf.checkAccessible: true
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetector - -Dio.netty.leakDetection.level: simple
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetector - -Dio.netty.leakDetection.maxRecords: 4
DEBUG gremlin-driver-loop-1 io.netty.util.ResourceLeakDetectorFactory - Loaded default ResourceLeakDetector: io.netty.util.ResourceLeakDetector@4d5bc32e
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpRequestDecoder settings - maxInitialLineLength=4096, maxHeaderSize=8192, maxChunkSize=8192
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpObjectAggregator settings - maxContentLength=65536, maxAccumulationBufferComponents=1024
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocketClientHandshaker13 - WebSocket version 13 client handshake key: qNRvrbuRb5EO45HfnTjSTg==, expected response: BqOCKNkYDt1KLyLt5ZMRzT0lRl4=
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] REGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] REGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] ACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] ACTIVE
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.maxCapacity.default: 32768
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.maxSharedCapacityFactor: 2
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.linkCapacity: 16
DEBUG gremlin-driver-loop-1 io.netty.util.Recycler - -Dio.netty.recycler.ratio: 8
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED: 207B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 47 45 54 20 2f 67 72 65 6d 6c 69 6e 20 48 54 54 |GET /gremlin HTT|
|00000010| 50 2f 31 2e 31 0d 0a 55 70 67 72 61 64 65 3a 20 |P/1.1..Upgrade: |
|00000020| 57 65 62 53 6f 63 6b 65 74 0d 0a 43 6f 6e 6e 65 |WebSocket..Conne|
|00000030| 63 74 69 6f 6e 3a 20 55 70 67 72 61 64 65 0d 0a |ction: Upgrade..|
|00000040| 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d 4b 65 |Sec-WebSocket-Ke|
|00000050| 79 3a 20 71 4e 52 76 72 62 75 52 62 35 45 4f 34 |y: qNRvrbuRb5EO4|
|00000060| 35 48 66 6e 54 6a 53 54 67 3d 3d 0d 0a 48 6f 73 |5HfnTjSTg==..Hos|
|00000070| 74 3a 20 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 |t: localhost:459|
|00000080| 34 30 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 |40..Sec-WebSocke|
|00000090| 74 2d 4f 72 69 67 69 6e 3a 20 68 74 74 70 3a 2f |t-Origin: http:/|
|000000a0| 2f 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 34 30 |/localhost:45940|
|000000b0| 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d |..Sec-WebSocket-|
|000000c0| 56 65 72 73 69 6f 6e 3a 20 31 33 0d 0a 0d 0a    |Version: 13.... |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED: DefaultHttpRequest(decodeResult: success, version: HTTP/1.1)
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: qNRvrbuRb5EO45HfnTjSTg==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED, EmptyLastHttpContent, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED, HttpObjectAggregator$AggregatedFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: CompositeByteBuf(ridx: 0, widx: 0, cap: 0, components=0))
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: qNRvrbuRb5EO45HfnTjSTg==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
Content-Length: 0, 0B
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WebSocket version V13 server handshake
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - WebSocket version 13 server handshake key: qNRvrbuRb5EO45HfnTjSTg==, response: BqOCKNkYDt1KLyLt5ZMRzT0lRl4=
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: BqOCKNkYDt1KLyLt5ZMRzT0lRl4=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: BqOCKNkYDt1KLyLt5ZMRzT0lRl4=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 42 71 4f 43 4b 4e 6b 59 44 74 31 4b 4c 79 4c | BqOCKNkYDt1KLyL|
|00000070| 74 35 5a 4d 52 7a 54 30 6c 52 6c 34 3d 0d 0a 0d |t5ZMRzT0lRl4=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 42 71 4f 43 4b 4e 6b 59 44 74 31 4b 4c 79 4c | BqOCKNkYDt1KLyL|
|00000070| 74 35 5a 4d 52 7a 54 30 6c 52 6c 34 3d 0d 0a 0d |t5ZMRzT0lRl4=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 42 71 4f 43 4b 4e 6b 59 44 74 31 4b 4c 79 4c | BqOCKNkYDt1KLyL|
|00000070| 74 35 5a 4d 52 7a 54 30 6c 52 6c 34 3d 0d 0a 0d |t5ZMRzT0lRl4=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] USER_EVENT: HANDSHAKE_COMPLETE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] USER_EVENT: HANDSHAKE_COMPLETE
INFO main org.apache.tinkerpop.gremlin.driver.Connection - Created new connection for ws://localhost:45940/gremlin
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpRequestDecoder settings - maxInitialLineLength=4096, maxHeaderSize=8192, maxChunkSize=8192
DEBUG gremlin-server-worker-1 org.apache.tinkerpop.gremlin.server.channel.WebSocketChannelizer - HttpObjectAggregator settings - maxContentLength=65536, maxAccumulationBufferComponents=1024
DEBUG gremlin-driver-loop-2 io.netty.handler.codec.http.websocketx.WebSocketClientHandshaker13 - WebSocket version 13 client handshake key: GT2Bk3K2TJrQGrjc3HZkLw==, expected response: 7FiSebxNWlZPcJ49hfpEcITh6gI=
DEBUG gremlin-server-worker-1 log-io - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] REGISTERED
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] REGISTERED
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] REGISTERED
DEBUG gremlin-server-worker-1 log-io - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] ACTIVE
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] ACTIVE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] ACTIVE
DEBUG gremlin-server-worker-1 log-io - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] RECEIVED: 207B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 47 45 54 20 2f 67 72 65 6d 6c 69 6e 20 48 54 54 |GET /gremlin HTT|
|00000010| 50 2f 31 2e 31 0d 0a 55 70 67 72 61 64 65 3a 20 |P/1.1..Upgrade: |
|00000020| 57 65 62 53 6f 63 6b 65 74 0d 0a 43 6f 6e 6e 65 |WebSocket..Conne|
|00000030| 63 74 69 6f 6e 3a 20 55 70 67 72 61 64 65 0d 0a |ction: Upgrade..|
|00000040| 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d 4b 65 |Sec-WebSocket-Ke|
|00000050| 79 3a 20 47 54 32 42 6b 33 4b 32 54 4a 72 51 47 |y: GT2Bk3K2TJrQG|
|00000060| 72 6a 63 33 48 5a 6b 4c 77 3d 3d 0d 0a 48 6f 73 |rjc3HZkLw==..Hos|
|00000070| 74 3a 20 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 |t: localhost:459|
|00000080| 34 30 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 |40..Sec-WebSocke|
|00000090| 74 2d 4f 72 69 67 69 6e 3a 20 68 74 74 70 3a 2f |t-Origin: http:/|
|000000a0| 2f 6c 6f 63 61 6c 68 6f 73 74 3a 34 35 39 34 30 |/localhost:45940|
|000000b0| 0d 0a 53 65 63 2d 57 65 62 53 6f 63 6b 65 74 2d |..Sec-WebSocket-|
|000000c0| 56 65 72 73 69 6f 6e 3a 20 31 33 0d 0a 0d 0a    |Version: 13.... |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] RECEIVED: DefaultHttpRequest(decodeResult: success, version: HTTP/1.1)
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: GT2Bk3K2TJrQGrjc3HZkLw==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] RECEIVED, EmptyLastHttpContent, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] RECEIVED, HttpObjectAggregator$AggregatedFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: CompositeByteBuf(ridx: 0, widx: 0, cap: 0, components=0))
GET /gremlin HTTP/1.1
Upgrade: WebSocket
Connection: Upgrade
Sec-WebSocket-Key: GT2Bk3K2TJrQGrjc3HZkLw==
Host: localhost:45940
Sec-WebSocket-Origin: http://localhost:45940
Sec-WebSocket-Version: 13
Content-Length: 0, 0B
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] WebSocket version V13 server handshake
DEBUG gremlin-server-worker-1 io.netty.handler.codec.http.websocketx.WebSocketServerHandshaker - WebSocket version 13 server handshake key: GT2Bk3K2TJrQGrjc3HZkLw==, response: 7FiSebxNWlZPcJ49hfpEcITh6gI=
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: 7FiSebxNWlZPcJ49hfpEcITh6gI=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] WRITE, DefaultFullHttpResponse(decodeResult: success, version: HTTP/1.1, content: UnpooledUnsafeHeapByteBuf(ridx: 0, widx: 0, cap: 0))
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: 7FiSebxNWlZPcJ49hfpEcITh6gI=, 0B
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 37 46 69 53 65 62 78 4e 57 6c 5a 50 63 4a 34 | 7FiSebxNWlZPcJ4|
|00000070| 39 68 66 70 45 63 49 54 68 36 67 49 3d 0d 0a 0d |9hfpEcITh6gI=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 37 46 69 53 65 62 78 4e 57 6c 5a 50 63 4a 34 | 7FiSebxNWlZPcJ4|
|00000070| 39 68 66 70 45 63 49 54 68 36 67 49 3d 0d 0a 0d |9hfpEcITh6gI=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-io - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] WRITE: 129B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 48 54 54 50 2f 31 2e 31 20 31 30 31 20 53 77 69 |HTTP/1.1 101 Swi|
|00000010| 74 63 68 69 6e 67 20 50 72 6f 74 6f 63 6f 6c 73 |tching Protocols|
|00000020| 0d 0a 55 70 67 72 61 64 65 3a 20 77 65 62 73 6f |..Upgrade: webso|
|00000030| 63 6b 65 74 0d 0a 43 6f 6e 6e 65 63 74 69 6f 6e |cket..Connection|
|00000040| 3a 20 55 70 67 72 61 64 65 0d 0a 53 65 63 2d 57 |: Upgrade..Sec-W|
|00000050| 65 62 53 6f 63 6b 65 74 2d 41 63 63 65 70 74 3a |ebSocket-Accept:|
|00000060| 20 37 46 69 53 65 62 78 4e 57 6c 5a 50 63 4a 34 | 7FiSebxNWlZPcJ4|
|00000070| 39 68 66 70 45 63 49 54 68 36 67 49 3d 0d 0a 0d |9hfpEcITh6gI=...|
|00000080| 0a                                              |.               |
+--------+-------------------------------------------------+----------------+
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] FLUSH
DEBUG gremlin-server-worker-1 log-decoder-aggregator - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] FLUSH
DEBUG gremlin-server-worker-1 log-io - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] FLUSH
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] USER_EVENT: HANDSHAKE_COMPLETE
DEBUG gremlin-server-worker-1 log-aggregator-encoder - [id: 0x427ebf66, L:/127.0.0.1:45940 - R:/127.0.0.1:60007] USER_EVENT: HANDSHAKE_COMPLETE
INFO main org.apache.tinkerpop.gremlin.driver.Connection - Created new connection for ws://localhost:45940/gremlin
INFO main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Opening connection pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} with core size of 2
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Borrowing connection from pool on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin} - timeout in 3000 MILLISECONDS
DEBUG main org.apache.tinkerpop.gremlin.driver.ConnectionPool - Return least used Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}, isDead=false, borrowed=1, pending=0} on Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}
DEBUG main org.apache.tinkerpop.gremlin.driver.Client - Submitted RequestMessage{, requestId=50b61b9b-1359-4413-8c39-63641edb8955, op='eval', processor='', args={batchSize=64, gremlin=g.V().hasLabel('software').has('name',n).in('created').values('name'), bindings={n=lop}}} to - Connection{host=Host{address=localhost/127.0.0.1:45940, hostUri=ws://localhost:45940/gremlin}}
DEBUG gremlin-driver-loop-1 io.netty.handler.codec.http.websocketx.WebSocket08FrameEncoder - Encoding WebSocket Frame opCode=2 length=176
DEBUG gremlin-server-worker-1 log-io - [id: 0x1b349e31, L:/127.0.0.1:45940 - R:/127.0.0.1:60006] RECEIVED: 184B
         +-------------------------------------------------+
         |  0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f |
+--------+-------------------------------------------------+----------------+
|00000000| 82 fe 00 b0 27 c2 c0 ef 06 a3 b0 9f 4b ab a3 8e |....'.......K...|
|00000010| 53 ab af 81 08 b4 ae 8b 09 a5 b2 8a 4a ae a9 81 |S...........J...|
|00000020| 0a b4 f1 c1 17 e9 a7 9d 5e ad c1 bf 91 d9 5b fc |........^.....[.|
|00000030| 7e 86 d3 63 1e a1 a4 f1 fc 4b 95 6e 42 b4 a1 03 |~..c.....K.nB...|
|00000040| 26 c1 c3 ee 45 a3 b4 8c 4f 91 a9 95 c2 c0 40 ee |&...E...O.....@.|
|00000050| 24 c3 a7 9d 42 af ac 86 c9 c1 c1 29 26 a5 ee b9 |$...B......)&...|
|00000060| 0f eb ee 87 46 b1 8c 8e 45 a7 ac c7 00 b1 af 89 |....F...E.......|
|00000070| 53 b5 a1 9d 42 e5 e9 c1 4f a3 b3 c7 00 ac a1 82 |S...B...O.......|
|00000080| 42 e5 ec 81 0e ec a9 81 0f e5 a3 9d 42 a3 b4 8a |B...........B...|
|00000090| 43 e5 e9 c1 51 a3 ac 9a 42 b1 e8 c8 49 a3 ad 8a |C...Q...B...I...|
|000000a0| 00 eb c3 ee 45 ab ae 8b 4e ac a7 1c 2a c3 c1 ec |....E...N...*...|
|000000b0| 26 40 ae ec 26 ae af 1f                         |&@..&...        |
+--------+-------------------------------------------------+----------------+
